Tekla.Structures.Plugins.DirectManipulation.Services.LineType
The Tekla.Structures.Plugins.DirectManipulation.Services.LineType enum defines what a line or curve represents.
This will affect the line color and width.

Tekla.Structures.Plugins.DirectManipulation.Services.LineType.GeometryPreview
The line is a representation of the final result after the modification.
This could be for example an edge or a mid-line of a solid resulting from the modification.

Tekla.Structures.Plugins.DirectManipulation.Services.LineType.Error
The line represents an error.

Tekla.Structures.Plugins.DirectManipulation.Services.LineType.Highlight
The line is highlighted in the model.